Possible results from invoking the DesignToFabricationConverter.
  Namespace:   Autodesk.Revit.DB.Fabrication
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
  Since:  2017
 Syntax
  C#
public enum DesignToFabricationConverterResult
  Visual Basic
Public Enumeration DesignToFabricationConverterResult
  Visual C++
public enum class DesignToFabricationConverterResult
 Members
  Member name  |   Description
   Success   |   Conversion was successful.
   PartialFailure   |   Conversion contained partial failures and will need to be fixed manually.
 See Also
  Autodesk.Revit.DB.Fabrication Namespace